# **Data Wrangling II**

## **Revisão Data Wrangling**

* A manipulação de dados ou Data Wrangling é o processo de limpeza e unificação de conjuntos de dados complexos e desordenados para facilitar seu acesso, análise e modelagem.
* Grande parte do tempo de um(a) cientista de dados é investido na manipulação de dados.

## **Etapas do data wrangling**
1. Descobrimento
2. Estruturação
3. Limpeza
4. Enriquecimento
5. Validação
6. publicação

## **Data Transformation**
### **Map**

Permite aos usuários aplicar uma função a cada elemento de uma lista, funcionando de forma iterativa, muito semelhante a um loop.

In [1]:
import pandas as pd
import numpy as np

In [2]:
aux_dict = {"Barbarian":[80, 90, 70, 95, 65], 
             "Prey":     [60, 65, 56, 65, 60], 
             "Mandy" :   [80, 57, 80, 78, 68],
             "Upgrade" : [78, 83, 67, 75, 55],
             "Premiado": ["Yes","Yes","No","No","No"]}
  
df = pd.DataFrame(aux_dict)
df

   Barbarian  Prey  Mandy  Upgrade Premiado
0         80    60     80       78      Yes
1         90    65     57       83      Yes
2         70    56     80       67       No
3         95    65     78       75       No
4         65    60     68       55       No

In [3]:
df["Premiado_dummy"] = df["Premiado"].map({"Yes": 1,
                                           "No":  0})
 
df

   Barbarian  Prey  Mandy  Upgrade Premiado  Premiado_dummy
0         80    60     80       78      Yes               1
1         90    65     57       83      Yes               1
2         70    56     80       67       No               0
3         95    65     78       75       No               0
4         65    60     68       55       No               0

In [4]:
z = [2,5,6,4,2,2,3,5,4]
func2 = lambda x: x * 2

mapped_numbers = map(func2, z)
list(mapped_numbers)

[4, 10, 12, 8, 4, 4, 6, 10, 8]

In [5]:
type(mapped_numbers)

map

In [6]:
func2 = lambda x: x * 2

mapped_numbers = map(func2, df["Upgrade"])
df["Upgrade2"] = list(mapped_numbers)
df

   Barbarian  Prey  Mandy  Upgrade Premiado  Premiado_dummy  Upgrade2
0         80    60     80       78      Yes               1       156
1         90    65     57       83      Yes               1       166
2         70    56     80       67       No               0       134
3         95    65     78       75       No               0       150
4         65    60     68       55       No               0       110

In [7]:
df.columns

Index(['Barbarian', 'Prey', 'Mandy', 'Upgrade', 'Premiado', 'Premiado_dummy',
       'Upgrade2'],
      dtype='object')

In [8]:
len(df.columns)

7

In [9]:
def len_names(x):
  return len(x)

x = map(len_names, df.columns)
list(x)

[9, 4, 5, 7, 8, 14, 8]

In [1]:
import pandas as pd
import numpy as np

In [2]:
p_data_df = pd.read_csv('https://raw.githubusercontent.com/jherfson/curso-coderhouse/main/aula13/p_data.csv', sep=';')
p_data_df.head()

,Age,Sex,ID,Race,Country,Education,Education-Num,Marital Status,Relationship
0,39.0,Male,49084,White,United-States,Bachelors,13.0,Never-married,Not-in-family
1,50.0,Male,68553,White,United-States,Bachelors,13.0,Married-civ-spouse,Husband
2,38.0,Male,143654,White,United-States,HS-grad,9.0,Divorced,Not-in-family
3,53.0,Male,41510,Black,United-States,11th,7.0,Married-civ-spouse,Husband
4,28.0,Female,195025,Black,Cuba,Bachelors,13.0,Married-civ-spouse,Wife

In [3]:
p_data_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48842 entries, 0 to 48841
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Age             48841 non-null  float64
 1   Sex             48841 non-null  object
 2   ID              48842 non-null  int64
 3   Race            48841 non-null  object
 4   Country         48841 non-null  object
 5   Education       48841 non-null  object
 6   Education-Num   48841 non-null  float64
 7   Marital Status  48841 non-null  object
 8   Relationship    48841 non-null  object
dtypes: float64(2), int64(1), object(6)
memory usage: 3.4+ MB

In [4]:
p_data_df = p_data_df.dropna()
p_data_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 48841 entries, 0 to 48841
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Age             48841 non-null  float64
 1   Sex             48841 non-null  object
 2   ID              48841 non-null  int64
 3   Race            48841 non-null  object
 4   Country         48841 non-null  object
 5   Education       48841 non-null  object
 6   Education-Num   48841 non-null  float64
 7   Marital Status  48841 non-null  object
 8   Relationship    48841 non-null  object
dtypes: float64(2), int64(1), object(6)
memory usage: 3.7+ MB

In [5]:
p_data_df['Sex'].unique()

array([' Male', ' Female'], dtype=object)

In [7]:
p_data_df['Sex'] = p_data_df['Sex'].str.strip()
p_data_df['Sex'].unique()

array(['Male', 'Female'], dtype=object)